1sem/DSS/aulas.tex
% Created 2021-10-22 Fri 17:36
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Mari§}
\date{\today}
\title{Aulas}
\hypersetup{
 pdfauthor={Mari§},
 pdftitle={Aulas},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{22 de outubro}
\label{sec:orgd6f13fb}
\subsection{Aula}
\label{sec:org092b33f}
\begin{itemize}
\item \textbf{Power Point:}
\begin{itemize}
\item Use Cases
\item Diagramas de Use Cases
\end{itemize}
\end{itemize}

\subsection{Projetos}
\label{sec:orgbffc1ec}
\begin{itemize}
\item \textbf{Validacao:}
\begin{itemize}
\item Completude
\item Consistenci+  nada de contradições
\item Correção: B+  explicito o que o cliente quer
\end{itemize}
\end{itemize}


\begin{itemize}
\item \textbf{A especificação deve ser:}
\begin{itemize}
\item realista
\item verificav+  (ter a certeza que podemos atingir todos os objetivos)
\item \ldots{}
\end{itemize}

\item \textbf{Visão  orientada}
\begin{itemize}
\item imaginar cenários
\item identificar e espe+ ficar casos d+ uso
\item \ldots{}
\end{itemize}
\end{itemize}

\subsection{Use case (+ sos possiveis)}
\label{sec:org2d80c5a}
\begin{itemize}
\item Descrição
\item Cenários+ + Pre condição
\item Pos condição
\item Fluxo normal
\item Fluxo alternativo
\item Fluxo de excepções
\end{itemize}

\subsection{Notas}
\label{sec:org349557f}
\begin{itemize}
\item O UML nãp especifica \textbf{use cases}
\end{itemize}
\end{document}
